This occurred for me when testing the creation of a new deployment. Here's the log, for posterity

```
Errors encountered making new deployment:

(.venv) jesse@vader ~/gi/azul (foo)$ make deploy 
make -C terraform apply
make[1]: Entering directory '/home/jesse/gi/azul/terraform'
python /home/jesse/gi/azul/scripts/check_branch.py
python providers.tf.json.template.py providers.tf.json
Creating providers.tf.json
python backend.tf.json.template.py backend.tf.json
Creating backend.tf.json
terraform init

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.70.0...
- Downloading plugin for provider "template" (hashicorp/template) 2.2.0...
- Downloading plugin for provider "null" (hashicorp/null) 2.1.2...
- Downloading plugin for provider "google" (hashicorp/google) 2.20.3...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
python api_gateway.tf.json.template.py api_gateway.tf.json
Creating api_gateway.tf.json
python authentication.tf.json.template.py authentication.tf.json
Creating authentication.tf.json
python cloudwatch.tf.json.template.py cloudwatch.tf.json
python common.tf.json.template.py common.tf.json
Creating common.tf.json
python dynamo.tf.json.template.py dynamo.tf.json
Creating dynamo.tf.json
python elasticsearch.tf.json.template.py elasticsearch.tf.json
python grafana_dashboard.tf.json.template.py grafana_dashboard.tf.json
python lambda_layer.tf.json.template.py lambda_layer.tf.json
Creating lambda_layer.tf.json
python modules.tf.json.template.py modules.tf.json
Creating modules.tf.json
python route53_health_check.tf.json.template.py route53_health_check.tf.json
python s3.tf.json.template.py s3.tf.json
Creating s3.tf.json
python sqs.tf.json.template.py sqs.tf.json
Creating sqs.tf.json
python step_function.tf.json.template.py step_function.tf.json
Creating step_function.tf.json
make -C /home/jesse/gi/azul/lambdas
make[2]: Entering directory '/home/jesse/gi/azul/lambdas'
make -C layer package
make[3]: Entering directory '/home/jesse/gi/azul/lambdas/layer'
python /home/jesse/gi/azul/scripts/check_branch.py
python .chalice/config.json.template.py .chalice/config.json
Creating .chalice/config.json
rm -rf vendor/jsonobject*
unzip /home/jesse/gi/azul/lambdas/.wheels/jsonobject-0.9.9-cp38-cp38-linux_x86_64.whl -d vendor
Archive:  /home/jesse/gi/azul/lambdas/.wheels/jsonobject-0.9.9-cp38-cp38-linux_x86_64.whl
  inflating: vendor/jsonobject/__init__.py  
  inflating: vendor/jsonobject/api.cpython-38-x86_64-linux-gnu.so  
  inflating: vendor/jsonobject/base.cpython-38-x86_64-linux-gnu.so  
  inflating: vendor/jsonobject/base_properties.cpython-38-x86_64-linux-gnu.so  
  inflating: vendor/jsonobject/containers.cpython-38-x86_64-linux-gnu.so  
  inflating: vendor/jsonobject/exceptions.py  
  inflating: vendor/jsonobject/properties.cpython-38-x86_64-linux-gnu.so  
  inflating: vendor/jsonobject/utils.cpython-38-x86_64-linux-gnu.so  
  inflating: vendor/jsonobject-0.9.9.dist-info/LICENSE  
  inflating: vendor/jsonobject-0.9.9.dist-info/METADATA  
  inflating: vendor/jsonobject-0.9.9.dist-info/WHEEL  
  inflating: vendor/jsonobject-0.9.9.dist-info/top_level.txt  
  inflating: vendor/jsonobject-0.9.9.dist-info/RECORD  
python /home/jesse/gi/azul/scripts/stage_layer.py
2021-04-22 14:36:34,406 INFO    MainThread: Using dependencies layer package at s3://edu-ucsc-gi-singlecell-azul-config-dev.us-east-1/azul/lambda_layer/e12a03a9671ebe8aeadc38fb30d555e47154a508.0470ec517e6792e738a3373c0038ae8e63c8117d.zip.
2021-04-22 14:36:34,406 INFO    MainThread: Checking if layer package needs updating ...
2021-04-22 14:36:34,416 INFO    MainThread: Found credentials in environment variables.
2021-04-22 14:36:34,925 INFO    MainThread: Layer package already up-to-date.
make[3]: Leaving directory '/home/jesse/gi/azul/lambdas/layer'
make -C indexer package
make[3]: Entering directory '/home/jesse/gi/azul/lambdas/indexer'
python /home/jesse/gi/azul/scripts/check_branch.py
python .chalice/config.json.template.py .chalice/config.json
Creating .chalice/config.json
PYTHONHASHSEED=0 python -m compileall -f -q --invalidation-mode checked-hash vendor vendor/azul
python -m azul.changelog vendor
chalice package --stage jesse0 --pkg-format terraform .chalice/terraform
Creating deployment package.
python /home/jesse/gi/azul/scripts/prepare_lambda_deployment.py indexer
2021-04-22 14:36:39,633 INFO    MainThread: Copying /home/jesse/gi/azul/lambdas/indexer/.chalice/terraform/deployment.zip to /home/jesse/gi/azul/terraform/indexer/deployment.zip
2021-04-22 14:36:39,634 INFO    MainThread: Transforming /home/jesse/gi/azul/lambdas/indexer/.chalice/terraform/chalice.tf.json to /home/jesse/gi/azul/terraform/indexer/chalice.tf.json
make[3]: Leaving directory '/home/jesse/gi/azul/lambdas/indexer'
make -C service package
make[3]: Entering directory '/home/jesse/gi/azul/lambdas/service'
python /home/jesse/gi/azul/scripts/check_branch.py
python .chalice/config.json.template.py .chalice/config.json
Creating .chalice/config.json
PYTHONHASHSEED=0 python -m compileall -f -q --invalidation-mode checked-hash vendor vendor/azul
python -m azul.changelog vendor
chalice package --stage jesse0 --pkg-format terraform .chalice/terraform
Creating deployment package.
python /home/jesse/gi/azul/scripts/prepare_lambda_deployment.py service
2021-04-22 14:36:44,728 INFO    MainThread: Copying /home/jesse/gi/azul/lambdas/service/.chalice/terraform/deployment.zip to /home/jesse/gi/azul/terraform/service/deployment.zip
2021-04-22 14:36:44,729 INFO    MainThread: Transforming /home/jesse/gi/azul/lambdas/service/.chalice/terraform/chalice.tf.json to /home/jesse/gi/azul/terraform/service/chalice.tf.json
make[3]: Leaving directory '/home/jesse/gi/azul/lambdas/service'
make[2]: Leaving directory '/home/jesse/gi/azul/lambdas'
terraform init
Initializing modules...
- chalice_indexer in indexer
- chalice_service in service

Initializing the backend...

Initializing provider plugins...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
terraform validate
Success! The configuration is valid.

python /home/jesse/gi/azul/scripts/rename_resources.py
make unlink_health_checks
make[2]: Entering directory '/home/jesse/gi/azul/terraform'
python /home/jesse/gi/azul/scripts/manage_health_checks.py --unlink
2021-04-22 14:36:54,224 INFO    MainThread: Found credentials in environment variables.
2021-04-22 14:36:54,781 INFO    MainThread: DCP wide health check does not exist for jesse0
make[2]: Leaving directory '/home/jesse/gi/azul/terraform'
terraform apply
data.google_client_config.current: Refreshing state...
module.chalice_service.data.null_data_source.chalice: Refreshing state...
module.chalice_indexer.data.null_data_source.chalice: Refreshing state...
data.aws_caller_identity.current: Refreshing state...
data.aws_route53_zone.azul_url: Refreshing state...
module.chalice_indexer.data.aws_region.chalice: Refreshing state...
module.chalice_indexer.data.aws_partition.chalice: Refreshing state...
module.chalice_service.data.aws_partition.chalice: Refreshing state...
data.aws_region.current: Refreshing state...
module.chalice_service.data.aws_caller_identity.chalice: Refreshing state...
data.aws_route53_zone.dev_singlecell_gi_ucsc_edu: Refreshing state...
module.chalice_indexer.data.aws_caller_identity.chalice: Refreshing state...
module.chalice_service.data.aws_region.chalice: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.indexer_0 will be created
  + resource "aws_acm_certificate" "indexer_0" {
      + arn                       = (known after apply)
      + domain_name               = "indexer.jesse0.dev.singlecell.gi.ucsc.edu"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = []
      + tags                      = {
          + "Name"       = "azul-indexer_0-jesse0"
          + "component"  = "azul-indexer_0"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.service_0 will be created
  + resource "aws_acm_certificate" "service_0" {
      + arn                       = (known after apply)
      + domain_name               = "service.jesse0.dev.singlecell.gi.ucsc.edu"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = []
      + tags                      = {
          + "Name"       = "azul-service_0-jesse0"
          + "component"  = "azul-service_0"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.service_1 will be created
  + resource "aws_acm_certificate" "service_1" {
      + arn                       = (known after apply)
      + domain_name               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = []
      + tags                      = {
          + "Name"       = "azul-service_1-jesse0"
          + "component"  = "azul-service_1"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.indexer_0 will be created
  + resource "aws_acm_certificate_validation" "indexer_0" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.service_0 will be created
  + resource "aws_acm_certificate_validation" "service_0" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.service_1 will be created
  + resource "aws_acm_certificate_validation" "service_1" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_api_gateway_base_path_mapping.indexer_0 will be created
  + resource "aws_api_gateway_base_path_mapping" "indexer_0" {
      + api_id      = (known after apply)
      + domain_name = "indexer.jesse0.dev.singlecell.gi.ucsc.edu"
      + id          = (known after apply)
      + stage_name  = "jesse0"
    }

  # aws_api_gateway_base_path_mapping.service_0 will be created
  + resource "aws_api_gateway_base_path_mapping" "service_0" {
      + api_id      = (known after apply)
      + domain_name = "service.jesse0.dev.singlecell.gi.ucsc.edu"
      + id          = (known after apply)
      + stage_name  = "jesse0"
    }

  # aws_api_gateway_base_path_mapping.service_1 will be created
  + resource "aws_api_gateway_base_path_mapping" "service_1" {
      + api_id      = (known after apply)
      + domain_name = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
      + id          = (known after apply)
      + stage_name  = "jesse0"
    }

  # aws_api_gateway_deployment.indexer will be created
  + resource "aws_api_gateway_deployment" "indexer" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "jesse0"
    }

  # aws_api_gateway_deployment.service will be created
  + resource "aws_api_gateway_deployment" "service" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "jesse0"
    }

  # aws_api_gateway_domain_name.indexer_0 will be created
  + resource "aws_api_gateway_domain_name" "indexer_0" {
      + arn                     = (known after apply)
      + certificate_arn         = (known after apply)
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "indexer.jesse0.dev.singlecell.gi.ucsc.edu"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = (known after apply)
      + tags                    = {
          + "Name"       = "azul-indexer_0-jesse0"
          + "component"  = "azul-indexer_0"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # aws_api_gateway_domain_name.service_0 will be created
  + resource "aws_api_gateway_domain_name" "service_0" {
      + arn                     = (known after apply)
      + certificate_arn         = (known after apply)
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "service.jesse0.dev.singlecell.gi.ucsc.edu"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = (known after apply)
      + tags                    = {
          + "Name"       = "azul-service_0-jesse0"
          + "component"  = "azul-service_0"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # aws_api_gateway_domain_name.service_1 will be created
  + resource "aws_api_gateway_domain_name" "service_1" {
      + arn                     = (known after apply)
      + certificate_arn         = (known after apply)
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = (known after apply)
      + tags                    = {
          + "Name"       = "azul-service_1-jesse0"
          + "component"  = "azul-service_1"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # aws_dynamodb_table.object_versions will be created
  + resource "aws_dynamodb_table" "object_versions" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "object_url"
      + id               = (known after apply)
      + name             = "azul-object_versions-jesse0"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name"       = "azul-object_versions-jesse0"
          + "component"  = "azul-object_versions"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }

      + attribute {
          + name = "object_url"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # aws_iam_role.indexer will be created
  + resource "aws_iam_role" "indexer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "azul-indexer-jesse0"
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::122796619775:policy/azul-boundary"
      + tags                  = {
          + "Name"       = "azul-indexer-jesse0"
          + "component"  = "azul-indexer"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.service will be created
  + resource "aws_iam_role" "service" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "azul-service-jesse0"
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::122796619775:policy/azul-boundary"
      + tags                  = {
          + "Name"       = "azul-service-jesse0"
          + "component"  = "azul-service"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.states will be created
  + resource "aws_iam_role" "states" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "azul-statemachine-jesse0"
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::122796619775:policy/azul-boundary"
      + tags                  = {
          + "Name"       = "azul-states-jesse0"
          + "component"  = "azul-states"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.indexer will be created
  + resource "aws_iam_role_policy" "indexer" {
      + id     = (known after apply)
      + name   = "indexer"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "es:ESHttpDelete",
                          + "es:ESHttpGet",
                          + "es:ESHttpHead",
                          + "es:ESHttpPut",
                          + "es:ESHttpPost",
                          + "es:ESHttpDelete",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:es:us-east-1:122796619775:domain/azul-index-sandbox/*"
                    },
                  + {
                      + Action   = [
                          + "es:DescribeElasticsearchDomain",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:es:us-east-1:122796619775:domain/azul-index-sandbox"
                    },
                  + {
                      + Action   = [
                          + "sqs:ChangeMessageVisibility*",
                          + "sqs:DeleteMessage*",
                          + "sqs:ReceiveMessage",
                          + "sqs:SendMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:us-east-1:122796619775:azul-notifications-jesse0",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-notifications_retry-jesse0",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-tallies-jesse0.fifo",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-tallies_retry-jesse0.fifo",
                        ]
                    },
                  + {
                      + Action   = [
                          + "sqs:GetQueueAttributes",
                          + "sqs:GetQueueUrl",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:us-east-1:122796619775:azul-notifications-jesse0",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-notifications_retry-jesse0",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-tallies-jesse0.fifo",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-tallies_retry-jesse0.fifo",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-tallies_fail-jesse0.fifo",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-notifications_fail-jesse0",
                        ]
                    },
                  + {
                      + Action   = [
                          + "sqs:ListQueues",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:us-east-1:122796619775:*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-1:122796619775:secret:*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::edu-ucsc-gi-singlecell-azul-storage-jesse0/health/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:122796619775:parameter/dcp/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.service will be created
  + resource "aws_iam_role_policy" "service" {
      + id     = (known after apply)
      + name   = "service"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "es:ESHttpDelete",
                          + "es:ESHttpGet",
                          + "es:ESHttpHead",
                          + "es:ESHttpPut",
                          + "es:ESHttpPost",
                          + "es:ESHttpDelete",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:es:us-east-1:122796619775:domain/azul-index-sandbox/*"
                    },
                  + {
                      + Action   = [
                          + "es:DescribeElasticsearchDomain",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:es:us-east-1:122796619775:domain/azul-index-sandbox"
                    },
                  + {
                      + Action   = [
                          + "sqs:GetQueueAttributes",
                          + "sqs:GetQueueUrl",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:us-east-1:122796619775:azul-notifications-jesse0",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-notifications_retry-jesse0",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-tallies-jesse0.fifo",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-tallies_retry-jesse0.fifo",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-tallies_fail-jesse0.fifo",
                          + "arn:aws:sqs:us-east-1:122796619775:azul-notifications_fail-jesse0",
                        ]
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-1:122796619775:secret:*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                          + "s3:PutObjectAcl",
                          + "s3:PutObjectTagging",
                          + "s3:GetObjectTagging",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::edu-ucsc-gi-singlecell-azul-storage-jesse0/*",
                          + "arn:aws:s3:::jesse0.dev.url.singlecell.gi.ucsc.edu/*",
                          + "arn:aws:s3:::edu-ucsc-gi-singlecell-azul-config-dev.us-east-1/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObjectVersion",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::edu-ucsc-gi-singlecell-azul-config-dev.us-east-1/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::edu-ucsc-gi-singlecell-azul-storage-jesse0",
                          + "arn:aws:s3:::jesse0.dev.url.singlecell.gi.ucsc.edu",
                          + "arn:aws:s3:::edu-ucsc-gi-singlecell-azul-config-dev.us-east-1",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Query",
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:DescribeTable",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:122796619775:table/azul-object_versions-jesse0",
                        ]
                    },
                  + {
                      + Action   = [
                          + "states:StartExecution",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:states:us-east-1:122796619775:stateMachine:azul-manifest-jesse0",
                        ]
                    },
                  + {
                      + Action   = [
                          + "states:DescribeExecution",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:states:us-east-1:122796619775:execution:azul-manifest-jesse0*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:122796619775:parameter/dcp/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.states will be created
  + resource "aws_iam_role_policy" "states" {
      + id     = (known after apply)
      + name   = "azul-statemachine-jesse0"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lambda:us-east-1:122796619775:function:azul-service-jesse0-manifest",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_lambda_layer_version.dependencies will be created
  + resource "aws_lambda_layer_version" "dependencies" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + id               = (known after apply)
      + layer_arn        = (known after apply)
      + layer_name       = "azul-dependencies-jesse0"
      + s3_bucket        = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
      + s3_key           = "azul/lambda_layer/e12a03a9671ebe8aeadc38fb30d555e47154a508.0470ec517e6792e738a3373c0038ae8e63c8117d.zip"
      + source_code_hash = (known after apply)
      + source_code_size = (known after apply)
      + version          = (known after apply)
    }

  # aws_route53_record.indexer_0 will be created
  + resource "aws_route53_record" "indexer_0" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "indexer.jesse0.dev.singlecell.gi.ucsc.edu"
      + type            = "A"
      + zone_id         = "ZRJRXAKW4OYOA"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.indexer_domain_validation_0 will be created
  + resource "aws_route53_record" "indexer_domain_validation_0" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "ZRJRXAKW4OYOA"
    }

  # aws_route53_record.service_0 will be created
  + resource "aws_route53_record" "service_0" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "service.jesse0.dev.singlecell.gi.ucsc.edu"
      + type            = "A"
      + zone_id         = "ZRJRXAKW4OYOA"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.service_1 will be created
  + resource "aws_route53_record" "service_1" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
      + type            = "A"
      + zone_id         = "ZRJRXAKW4OYOA"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.service_domain_validation_0 will be created
  + resource "aws_route53_record" "service_domain_validation_0" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "ZRJRXAKW4OYOA"
    }

  # aws_route53_record.service_domain_validation_1 will be created
  + resource "aws_route53_record" "service_domain_validation_1" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "ZRJRXAKW4OYOA"
    }

  # aws_route53_record.url_redirect_record will be created
  + resource "aws_route53_record" "url_redirect_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jesse0.dev.url.singlecell.gi.ucsc.edu"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z3QI5CRH8COLZN"
    }

  # aws_s3_bucket.storage will be created
  + resource "aws_s3_bucket" "storage" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"       = "azul-storage-jesse0"
          + "component"  = "azul-storage"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "manifests"
          + prefix  = "manifests/"

          + expiration {
              + days = 7
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.urls will be created
  + resource "aws_s3_bucket" "urls" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "jesse0.dev.url.singlecell.gi.ucsc.edu"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"       = "azul-urls-jesse0"
          + "component"  = "azul-urls"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + index_document = "404.html"
        }
    }

  # aws_sfn_state_machine.manifest will be created
  + resource "aws_sfn_state_machine" "manifest" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = jsonencode(
            {
              + StartAt = "WriteManifest"
              + States  = {
                  + WriteManifest = {
                      + End      = true
                      + Resource = "arn:aws:lambda:us-east-1:122796619775:function:azul-service-jesse0-manifest"
                      + Type     = "Task"
                    }
                }
            }
        )
      + id            = (known after apply)
      + name          = "azul-manifest-jesse0"
      + role_arn      = (known after apply)
      + status        = (known after apply)
      + tags          = {
          + "Name"       = "azul-manifest-jesse0"
          + "component"  = "azul-manifest"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
    }

  # aws_sqs_queue.notifications will be created
  + resource "aws_sqs_queue" "notifications" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "azul-notifications-jesse0"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + tags                              = {
          + "Name"       = "azul-notifications-jesse0"
          + "component"  = "azul-notifications"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + visibility_timeout_seconds        = 310
    }

  # aws_sqs_queue.notifications_fail will be created
  + resource "aws_sqs_queue" "notifications_fail" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "azul-notifications_fail-jesse0"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Name"       = "azul-notifications_fail-jesse0"
          + "component"  = "azul-notifications_fail"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.notifications_retry will be created
  + resource "aws_sqs_queue" "notifications_retry" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "azul-notifications_retry-jesse0"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + tags                              = {
          + "Name"       = "azul-notifications_retry-jesse0"
          + "component"  = "azul-notifications_retry"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + visibility_timeout_seconds        = 910
    }

  # aws_sqs_queue.tallies will be created
  + resource "aws_sqs_queue" "tallies" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 10
      + fifo_queue                        = true
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "azul-tallies-jesse0.fifo"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + tags                              = {
          + "Name"       = "azul-tallies-jesse0"
          + "component"  = "azul-tallies"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + visibility_timeout_seconds        = 70
    }

  # aws_sqs_queue.tallies_fail will be created
  + resource "aws_sqs_queue" "tallies_fail" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "azul-tallies_fail-jesse0.fifo"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Name"       = "azul-tallies_fail-jesse0"
          + "component"  = "azul-tallies_fail"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.tallies_retry will be created
  + resource "aws_sqs_queue" "tallies_retry" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 10
      + fifo_queue                        = true
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "azul-tallies_retry-jesse0.fifo"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + tags                              = {
          + "Name"       = "azul-tallies_retry-jesse0"
          + "component"  = "azul-tallies_retry"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
      + visibility_timeout_seconds        = 310
    }

  # google_project_iam_custom_role.azul will be created
  + resource "google_project_iam_custom_role" "azul" {
      + deleted     = (known after apply)
      + id          = (known after apply)
      + permissions = [
          + "bigquery.capacityCommitments.create",
          + "bigquery.capacityCommitments.delete",
          + "bigquery.capacityCommitments.list",
          + "bigquery.jobs.create",
          + "bigquery.reservationAssignments.create",
          + "bigquery.reservationAssignments.delete",
          + "bigquery.reservationAssignments.list",
          + "bigquery.reservations.create",
          + "bigquery.reservations.delete",
          + "bigquery.reservations.list",
        ]
      + project     = (known after apply)
      + role_id     = "azul_jesse0"
      + stage       = "GA"
      + title       = "azul_jesse0"
    }

  # google_project_iam_member.azul will be created
  + resource "google_project_iam_member" "azul" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "platform-hca-dev"
      + role    = (known after apply)
    }

  # google_service_account.azul will be created
  + resource "google_service_account" "azul" {
      + account_id   = "azul-ucsc-0-jesse0"
      + description  = "Azul service account in jesse0"
      + display_name = "azul-ucsc-0-jesse0"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "platform-hca-dev"
      + unique_id    = (known after apply)
    }

  # null_resource.hmac_secret will be created
  + resource "null_resource" "hmac_secret" {
      + id = (known after apply)
    }

  # module.chalice_indexer.data.template_file.chalice_api_swagger will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "chalice_api_swagger"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # module.chalice_indexer.aws_api_gateway_deployment.rest_api will be created
  + resource "aws_api_gateway_deployment" "rest_api" {
      + created_date      = (known after apply)
      + execution_arn     = (known after apply)
      + id                = (known after apply)
      + invoke_url        = (known after apply)
      + rest_api_id       = (known after apply)
      + stage_description = (known after apply)
      + stage_name        = "jesse0"
    }

  # module.chalice_indexer.aws_api_gateway_rest_api.rest_api will be created
  + resource "aws_api_gateway_rest_api" "rest_api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + binary_media_types       = [
          + "application/octet-stream",
          + "application/x-tar",
          + "application/zip",
          + "audio/basic",
          + "audio/ogg",
          + "audio/mp4",
          + "audio/mpeg",
          + "audio/wav",
          + "audio/webm",
          + "image/png",
          + "image/jpg",
          + "image/jpeg",
          + "image/gif",
          + "video/ogg",
          + "video/mpeg",
          + "video/webm",
        ]
      + body                     = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "azul-indexer-jesse0"
      + root_resource_id         = (known after apply)
      + tags                     = {
          + "Name"       = "azul-rest_api-jesse0"
          + "component"  = "azul-rest_api"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }

      + endpoint_configuration {
          + types = [
              + "EDGE",
            ]
        }
    }

  # module.chalice_indexer.aws_cloudwatch_event_rule.indexercachehealth will be created
  + resource "aws_cloudwatch_event_rule" "indexercachehealth" {
      + arn                 = (known after apply)
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "azul-indexercachehealth-jesse0"
      + schedule_expression = "rate(1 minute)"
      + tags                = {
          + "Name"       = "azul-indexercachehealth-jesse0"
          + "component"  = "azul-indexercachehealth"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
    }

  # module.chalice_indexer.aws_cloudwatch_event_target.indexercachehealth will be created
  + resource "aws_cloudwatch_event_target" "indexercachehealth" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "azul-indexercachehealth-jesse0"
      + target_id = "azul-indexercachehealth-jesse0"
    }

  # module.chalice_indexer.aws_lambda_event_source_mapping.aggregate-sqs-event-source will be created
  + resource "aws_lambda_event_source_mapping" "aggregate-sqs-event-source" {
      + batch_size                    = 10
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-east-1:122796619775:azul-tallies-jesse0.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = "azul-indexer-jesse0-aggregate"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.chalice_indexer.aws_lambda_event_source_mapping.aggregate_retry-sqs-event-source will be created
  + resource "aws_lambda_event_source_mapping" "aggregate_retry-sqs-event-source" {
      + batch_size                    = 10
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-east-1:122796619775:azul-tallies_retry-jesse0.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = "azul-indexer-jesse0-aggregate_retry"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.chalice_indexer.aws_lambda_event_source_mapping.contribute-sqs-event-source will be created
  + resource "aws_lambda_event_source_mapping" "contribute-sqs-event-source" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-east-1:122796619775:azul-notifications-jesse0"
      + function_arn                  = (known after apply)
      + function_name                 = "azul-indexer-jesse0-contribute"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.chalice_indexer.aws_lambda_event_source_mapping.contribute_retry-sqs-event-source will be created
  + resource "aws_lambda_event_source_mapping" "contribute_retry-sqs-event-source" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-east-1:122796619775:azul-notifications_retry-jesse0"
      + function_arn                  = (known after apply)
      + function_name                 = "azul-indexer-jesse0-contribute_retry"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.chalice_indexer.aws_lambda_function.aggregate will be created
  + resource "aws_lambda_function" "aggregate" {
      + arn                            = (known after apply)
      + filename                       = "indexer/deployment.zip"
      + function_name                  = "azul-indexer-jesse0-aggregate"
      + handler                        = "app.aggregate"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 256
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 8
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "5s3MUoMcspLtmqXMOOZl0EU0iybPW9RK9skn9NXEOqc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"        = "azul-aggregate-jesse0"
          + "aws-chalice" = "version=1.18.0:stage=jesse0:app=azul-indexer"
          + "component"   = "azul-aggregate"
          + "deployment"  = "jesse0"
          + "owner"       = "jrbrenna@ucsc.edu"
          + "project"     = "dcp"
          + "service"     = "azul"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AZUL_AWS_ACCOUNT_ID"                = "122796619775"
              + "AZUL_CATALOGS"                      = "hca:dcp2:repository/tdr:metadata/hca,hca:dcp2ebi:repository/tdr:metadata/hca,lungmap:lungmap:repository/tdr:metadata/hca,hca:it2:repository/tdr:metadata/hca,hca:it2ebi:repository/tdr:metadata/hca,lungmap:it3lungmap:repository/tdr:metadata/hca"
              + "AZUL_DEBUG"                         = "1"
              + "AZUL_DEPLOYMENT_INCARNATION"        = "0"
              + "AZUL_DEPLOYMENT_STAGE"              = "jesse0"
              + "AZUL_DISABLE_MULTIPART_MANIFESTS"   = "0"
              + "AZUL_DOMAIN_NAME"                   = "dev.singlecell.gi.ucsc.edu"
              + "AZUL_DRS_DOMAIN_NAME"               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
              + "AZUL_DSS_DIRECT_ACCESS"             = "0"
              + "AZUL_DSS_WORKERS"                   = "8"
              + "AZUL_ENABLE_MONITORING"             = "0"
              + "AZUL_ES_DOMAIN"                     = "azul-index-sandbox"
              + "AZUL_ES_ENDPOINT"                   = "search-azul-index-sandbox-mcwjphhhdivigzrsrdmxm2uude.us-east-1.es.amazonaws.com:443"
              + "AZUL_ES_INSTANCE_COUNT"             = "2"
              + "AZUL_ES_INSTANCE_TYPE"              = "r4.2xlarge.elasticsearch"
              + "AZUL_ES_TIMEOUT"                    = "60"
              + "AZUL_ES_VOLUME_SIZE"                = "70"
              + "AZUL_GOOGLE_SERVICE_ACCOUNT"        = "azul-ucsc-0-jesse0"
              + "AZUL_INDEXER_CONCURRENCY"           = "8"
              + "AZUL_INDEX_PREFIX"                  = "azul"
              + "AZUL_OWNER"                         = "jrbrenna@ucsc.edu"
              + "AZUL_RESOURCE_PREFIX"               = "azul"
              + "AZUL_S3_BUCKET"                     = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
              + "AZUL_SAM_SERVICE_URL"               = "https://sam.dsde-dev.broadinstitute.org"
              + "AZUL_SHARE_ES_DOMAIN"               = "1"
              + "AZUL_SUBDOMAIN_TEMPLATE"            = "*.jesse0"
              + "AZUL_SUBSCRIBE_TO_DSS"              = "0"
              + "AZUL_TDR_DCP2EBI_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT2EBI_SOURCES"            = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT3LUNGMAP_SOURCES"        = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_LUNGMAP_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_SERVICE_URL"               = "https://jade.datarepo-dev.broadinstitute.org"
              + "AZUL_TDR_SOURCES"                   = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201203___20210219"
              + "AZUL_TDR_WORKERS"                   = "1"
              + "AZUL_URL_REDIRECT_BASE_DOMAIN_NAME" = "dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_URL_REDIRECT_FULL_DOMAIN_NAME" = "jesse0.dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_VERSIONED_BUCKET"              = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
              + "XDG_CONFIG_HOME"                    = "/tmp"
              + "azul_git_commit"                    = "9aab4f6a4460309044cd457dc8fc9a5ecf6140f2"
              + "azul_git_dirty"                     = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.chalice_indexer.aws_lambda_function.aggregate_retry will be created
  + resource "aws_lambda_function" "aggregate_retry" {
      + arn                            = (known after apply)
      + filename                       = "indexer/deployment.zip"
      + function_name                  = "azul-indexer-jesse0-aggregate_retry"
      + handler                        = "app.aggregate_retry"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 3008
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 8
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "5s3MUoMcspLtmqXMOOZl0EU0iybPW9RK9skn9NXEOqc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"        = "azul-aggregate_retry-jesse0"
          + "aws-chalice" = "version=1.18.0:stage=jesse0:app=azul-indexer"
          + "component"   = "azul-aggregate_retry"
          + "deployment"  = "jesse0"
          + "owner"       = "jrbrenna@ucsc.edu"
          + "project"     = "dcp"
          + "service"     = "azul"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AZUL_AWS_ACCOUNT_ID"                = "122796619775"
              + "AZUL_CATALOGS"                      = "hca:dcp2:repository/tdr:metadata/hca,hca:dcp2ebi:repository/tdr:metadata/hca,lungmap:lungmap:repository/tdr:metadata/hca,hca:it2:repository/tdr:metadata/hca,hca:it2ebi:repository/tdr:metadata/hca,lungmap:it3lungmap:repository/tdr:metadata/hca"
              + "AZUL_DEBUG"                         = "1"
              + "AZUL_DEPLOYMENT_INCARNATION"        = "0"
              + "AZUL_DEPLOYMENT_STAGE"              = "jesse0"
              + "AZUL_DISABLE_MULTIPART_MANIFESTS"   = "0"
              + "AZUL_DOMAIN_NAME"                   = "dev.singlecell.gi.ucsc.edu"
              + "AZUL_DRS_DOMAIN_NAME"               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
              + "AZUL_DSS_DIRECT_ACCESS"             = "0"
              + "AZUL_DSS_WORKERS"                   = "8"
              + "AZUL_ENABLE_MONITORING"             = "0"
              + "AZUL_ES_DOMAIN"                     = "azul-index-sandbox"
              + "AZUL_ES_ENDPOINT"                   = "search-azul-index-sandbox-mcwjphhhdivigzrsrdmxm2uude.us-east-1.es.amazonaws.com:443"
              + "AZUL_ES_INSTANCE_COUNT"             = "2"
              + "AZUL_ES_INSTANCE_TYPE"              = "r4.2xlarge.elasticsearch"
              + "AZUL_ES_TIMEOUT"                    = "60"
              + "AZUL_ES_VOLUME_SIZE"                = "70"
              + "AZUL_GOOGLE_SERVICE_ACCOUNT"        = "azul-ucsc-0-jesse0"
              + "AZUL_INDEXER_CONCURRENCY"           = "8"
              + "AZUL_INDEX_PREFIX"                  = "azul"
              + "AZUL_OWNER"                         = "jrbrenna@ucsc.edu"
              + "AZUL_RESOURCE_PREFIX"               = "azul"
              + "AZUL_S3_BUCKET"                     = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
              + "AZUL_SAM_SERVICE_URL"               = "https://sam.dsde-dev.broadinstitute.org"
              + "AZUL_SHARE_ES_DOMAIN"               = "1"
              + "AZUL_SUBDOMAIN_TEMPLATE"            = "*.jesse0"
              + "AZUL_SUBSCRIBE_TO_DSS"              = "0"
              + "AZUL_TDR_DCP2EBI_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT2EBI_SOURCES"            = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT3LUNGMAP_SOURCES"        = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_LUNGMAP_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_SERVICE_URL"               = "https://jade.datarepo-dev.broadinstitute.org"
              + "AZUL_TDR_SOURCES"                   = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201203___20210219"
              + "AZUL_TDR_WORKERS"                   = "1"
              + "AZUL_URL_REDIRECT_BASE_DOMAIN_NAME" = "dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_URL_REDIRECT_FULL_DOMAIN_NAME" = "jesse0.dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_VERSIONED_BUCKET"              = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
              + "XDG_CONFIG_HOME"                    = "/tmp"
              + "azul_git_commit"                    = "9aab4f6a4460309044cd457dc8fc9a5ecf6140f2"
              + "azul_git_dirty"                     = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.chalice_indexer.aws_lambda_function.api_handler will be created
  + resource "aws_lambda_function" "api_handler" {
      + arn                            = (known after apply)
      + filename                       = "indexer/deployment.zip"
      + function_name                  = "azul-indexer-jesse0"
      + handler                        = "app.app"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "5s3MUoMcspLtmqXMOOZl0EU0iybPW9RK9skn9NXEOqc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"        = "azul-api_handler-jesse0"
          + "aws-chalice" = "version=1.18.0:stage=jesse0:app=azul-indexer"
          + "component"   = "azul-api_handler"
          + "deployment"  = "jesse0"
          + "owner"       = "jrbrenna@ucsc.edu"
          + "project"     = "dcp"
          + "service"     = "azul"
        }
      + timeout                        = 31
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AZUL_AWS_ACCOUNT_ID"                = "122796619775"
              + "AZUL_CATALOGS"                      = "hca:dcp2:repository/tdr:metadata/hca,hca:dcp2ebi:repository/tdr:metadata/hca,lungmap:lungmap:repository/tdr:metadata/hca,hca:it2:repository/tdr:metadata/hca,hca:it2ebi:repository/tdr:metadata/hca,lungmap:it3lungmap:repository/tdr:metadata/hca"
              + "AZUL_DEBUG"                         = "1"
              + "AZUL_DEPLOYMENT_INCARNATION"        = "0"
              + "AZUL_DEPLOYMENT_STAGE"              = "jesse0"
              + "AZUL_DISABLE_MULTIPART_MANIFESTS"   = "0"
              + "AZUL_DOMAIN_NAME"                   = "dev.singlecell.gi.ucsc.edu"
              + "AZUL_DRS_DOMAIN_NAME"               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
              + "AZUL_DSS_DIRECT_ACCESS"             = "0"
              + "AZUL_DSS_WORKERS"                   = "8"
              + "AZUL_ENABLE_MONITORING"             = "0"
              + "AZUL_ES_DOMAIN"                     = "azul-index-sandbox"
              + "AZUL_ES_ENDPOINT"                   = "search-azul-index-sandbox-mcwjphhhdivigzrsrdmxm2uude.us-east-1.es.amazonaws.com:443"
              + "AZUL_ES_INSTANCE_COUNT"             = "2"
              + "AZUL_ES_INSTANCE_TYPE"              = "r4.2xlarge.elasticsearch"
              + "AZUL_ES_TIMEOUT"                    = "60"
              + "AZUL_ES_VOLUME_SIZE"                = "70"
              + "AZUL_GOOGLE_SERVICE_ACCOUNT"        = "azul-ucsc-0-jesse0"
              + "AZUL_INDEXER_CONCURRENCY"           = "8"
              + "AZUL_INDEX_PREFIX"                  = "azul"
              + "AZUL_OWNER"                         = "jrbrenna@ucsc.edu"
              + "AZUL_RESOURCE_PREFIX"               = "azul"
              + "AZUL_S3_BUCKET"                     = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
              + "AZUL_SAM_SERVICE_URL"               = "https://sam.dsde-dev.broadinstitute.org"
              + "AZUL_SHARE_ES_DOMAIN"               = "1"
              + "AZUL_SUBDOMAIN_TEMPLATE"            = "*.jesse0"
              + "AZUL_SUBSCRIBE_TO_DSS"              = "0"
              + "AZUL_TDR_DCP2EBI_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT2EBI_SOURCES"            = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT3LUNGMAP_SOURCES"        = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_LUNGMAP_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_SERVICE_URL"               = "https://jade.datarepo-dev.broadinstitute.org"
              + "AZUL_TDR_SOURCES"                   = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201203___20210219"
              + "AZUL_TDR_WORKERS"                   = "1"
              + "AZUL_URL_REDIRECT_BASE_DOMAIN_NAME" = "dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_URL_REDIRECT_FULL_DOMAIN_NAME" = "jesse0.dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_VERSIONED_BUCKET"              = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
              + "XDG_CONFIG_HOME"                    = "/tmp"
              + "azul_git_commit"                    = "9aab4f6a4460309044cd457dc8fc9a5ecf6140f2"
              + "azul_git_dirty"                     = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.chalice_indexer.aws_lambda_function.contribute will be created
  + resource "aws_lambda_function" "contribute" {
      + arn                            = (known after apply)
      + filename                       = "indexer/deployment.zip"
      + function_name                  = "azul-indexer-jesse0-contribute"
      + handler                        = "app.contribute"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 256
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 8
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "5s3MUoMcspLtmqXMOOZl0EU0iybPW9RK9skn9NXEOqc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"        = "azul-contribute-jesse0"
          + "aws-chalice" = "version=1.18.0:stage=jesse0:app=azul-indexer"
          + "component"   = "azul-contribute"
          + "deployment"  = "jesse0"
          + "owner"       = "jrbrenna@ucsc.edu"
          + "project"     = "dcp"
          + "service"     = "azul"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AZUL_AWS_ACCOUNT_ID"                = "122796619775"
              + "AZUL_CATALOGS"                      = "hca:dcp2:repository/tdr:metadata/hca,hca:dcp2ebi:repository/tdr:metadata/hca,lungmap:lungmap:repository/tdr:metadata/hca,hca:it2:repository/tdr:metadata/hca,hca:it2ebi:repository/tdr:metadata/hca,lungmap:it3lungmap:repository/tdr:metadata/hca"
              + "AZUL_DEBUG"                         = "1"
              + "AZUL_DEPLOYMENT_INCARNATION"        = "0"
              + "AZUL_DEPLOYMENT_STAGE"              = "jesse0"
              + "AZUL_DISABLE_MULTIPART_MANIFESTS"   = "0"
              + "AZUL_DOMAIN_NAME"                   = "dev.singlecell.gi.ucsc.edu"
              + "AZUL_DRS_DOMAIN_NAME"               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
              + "AZUL_DSS_DIRECT_ACCESS"             = "0"
              + "AZUL_DSS_WORKERS"                   = "8"
              + "AZUL_ENABLE_MONITORING"             = "0"
              + "AZUL_ES_DOMAIN"                     = "azul-index-sandbox"
              + "AZUL_ES_ENDPOINT"                   = "search-azul-index-sandbox-mcwjphhhdivigzrsrdmxm2uude.us-east-1.es.amazonaws.com:443"
              + "AZUL_ES_INSTANCE_COUNT"             = "2"
              + "AZUL_ES_INSTANCE_TYPE"              = "r4.2xlarge.elasticsearch"
              + "AZUL_ES_TIMEOUT"                    = "60"
              + "AZUL_ES_VOLUME_SIZE"                = "70"
              + "AZUL_GOOGLE_SERVICE_ACCOUNT"        = "azul-ucsc-0-jesse0"
              + "AZUL_INDEXER_CONCURRENCY"           = "8"
              + "AZUL_INDEX_PREFIX"                  = "azul"
              + "AZUL_OWNER"                         = "jrbrenna@ucsc.edu"
              + "AZUL_RESOURCE_PREFIX"               = "azul"
              + "AZUL_S3_BUCKET"                     = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
              + "AZUL_SAM_SERVICE_URL"               = "https://sam.dsde-dev.broadinstitute.org"
              + "AZUL_SHARE_ES_DOMAIN"               = "1"
              + "AZUL_SUBDOMAIN_TEMPLATE"            = "*.jesse0"
              + "AZUL_SUBSCRIBE_TO_DSS"              = "0"
              + "AZUL_TDR_DCP2EBI_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT2EBI_SOURCES"            = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT3LUNGMAP_SOURCES"        = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_LUNGMAP_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_SERVICE_URL"               = "https://jade.datarepo-dev.broadinstitute.org"
              + "AZUL_TDR_SOURCES"                   = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201203___20210219"
              + "AZUL_TDR_WORKERS"                   = "1"
              + "AZUL_URL_REDIRECT_BASE_DOMAIN_NAME" = "dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_URL_REDIRECT_FULL_DOMAIN_NAME" = "jesse0.dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_VERSIONED_BUCKET"              = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
              + "XDG_CONFIG_HOME"                    = "/tmp"
              + "azul_git_commit"                    = "9aab4f6a4460309044cd457dc8fc9a5ecf6140f2"
              + "azul_git_dirty"                     = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.chalice_indexer.aws_lambda_function.contribute_retry will be created
  + resource "aws_lambda_function" "contribute_retry" {
      + arn                            = (known after apply)
      + filename                       = "indexer/deployment.zip"
      + function_name                  = "azul-indexer-jesse0-contribute_retry"
      + handler                        = "app.contribute_retry"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 4096
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 8
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "5s3MUoMcspLtmqXMOOZl0EU0iybPW9RK9skn9NXEOqc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"        = "azul-contribute_retry-jesse0"
          + "aws-chalice" = "version=1.18.0:stage=jesse0:app=azul-indexer"
          + "component"   = "azul-contribute_retry"
          + "deployment"  = "jesse0"
          + "owner"       = "jrbrenna@ucsc.edu"
          + "project"     = "dcp"
          + "service"     = "azul"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AZUL_AWS_ACCOUNT_ID"                = "122796619775"
              + "AZUL_CATALOGS"                      = "hca:dcp2:repository/tdr:metadata/hca,hca:dcp2ebi:repository/tdr:metadata/hca,lungmap:lungmap:repository/tdr:metadata/hca,hca:it2:repository/tdr:metadata/hca,hca:it2ebi:repository/tdr:metadata/hca,lungmap:it3lungmap:repository/tdr:metadata/hca"
              + "AZUL_DEBUG"                         = "1"
              + "AZUL_DEPLOYMENT_INCARNATION"        = "0"
              + "AZUL_DEPLOYMENT_STAGE"              = "jesse0"
              + "AZUL_DISABLE_MULTIPART_MANIFESTS"   = "0"
              + "AZUL_DOMAIN_NAME"                   = "dev.singlecell.gi.ucsc.edu"
              + "AZUL_DRS_DOMAIN_NAME"               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
              + "AZUL_DSS_DIRECT_ACCESS"             = "0"
              + "AZUL_DSS_WORKERS"                   = "8"
              + "AZUL_ENABLE_MONITORING"             = "0"
              + "AZUL_ES_DOMAIN"                     = "azul-index-sandbox"
              + "AZUL_ES_ENDPOINT"                   = "search-azul-index-sandbox-mcwjphhhdivigzrsrdmxm2uude.us-east-1.es.amazonaws.com:443"
              + "AZUL_ES_INSTANCE_COUNT"             = "2"
              + "AZUL_ES_INSTANCE_TYPE"              = "r4.2xlarge.elasticsearch"
              + "AZUL_ES_TIMEOUT"                    = "60"
              + "AZUL_ES_VOLUME_SIZE"                = "70"
              + "AZUL_GOOGLE_SERVICE_ACCOUNT"        = "azul-ucsc-0-jesse0"
              + "AZUL_INDEXER_CONCURRENCY"           = "8"
              + "AZUL_INDEX_PREFIX"                  = "azul"
              + "AZUL_OWNER"                         = "jrbrenna@ucsc.edu"
              + "AZUL_RESOURCE_PREFIX"               = "azul"
              + "AZUL_S3_BUCKET"                     = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
              + "AZUL_SAM_SERVICE_URL"               = "https://sam.dsde-dev.broadinstitute.org"
              + "AZUL_SHARE_ES_DOMAIN"               = "1"
              + "AZUL_SUBDOMAIN_TEMPLATE"            = "*.jesse0"
              + "AZUL_SUBSCRIBE_TO_DSS"              = "0"
              + "AZUL_TDR_DCP2EBI_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT2EBI_SOURCES"            = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT3LUNGMAP_SOURCES"        = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_LUNGMAP_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_SERVICE_URL"               = "https://jade.datarepo-dev.broadinstitute.org"
              + "AZUL_TDR_SOURCES"                   = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201203___20210219"
              + "AZUL_TDR_WORKERS"                   = "1"
              + "AZUL_URL_REDIRECT_BASE_DOMAIN_NAME" = "dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_URL_REDIRECT_FULL_DOMAIN_NAME" = "jesse0.dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_VERSIONED_BUCKET"              = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
              + "XDG_CONFIG_HOME"                    = "/tmp"
              + "azul_git_commit"                    = "9aab4f6a4460309044cd457dc8fc9a5ecf6140f2"
              + "azul_git_dirty"                     = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.chalice_indexer.aws_lambda_function.indexercachehealth will be created
  + resource "aws_lambda_function" "indexercachehealth" {
      + arn                            = (known after apply)
      + filename                       = "indexer/deployment.zip"
      + function_name                  = "azul-indexer-jesse0-indexercachehealth"
      + handler                        = "app.update_health_cache"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "5s3MUoMcspLtmqXMOOZl0EU0iybPW9RK9skn9NXEOqc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"        = "azul-indexercachehealth-jesse0"
          + "aws-chalice" = "version=1.18.0:stage=jesse0:app=azul-indexer"
          + "component"   = "azul-indexercachehealth"
          + "deployment"  = "jesse0"
          + "owner"       = "jrbrenna@ucsc.edu"
          + "project"     = "dcp"
          + "service"     = "azul"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AZUL_AWS_ACCOUNT_ID"                = "122796619775"
              + "AZUL_CATALOGS"                      = "hca:dcp2:repository/tdr:metadata/hca,hca:dcp2ebi:repository/tdr:metadata/hca,lungmap:lungmap:repository/tdr:metadata/hca,hca:it2:repository/tdr:metadata/hca,hca:it2ebi:repository/tdr:metadata/hca,lungmap:it3lungmap:repository/tdr:metadata/hca"
              + "AZUL_DEBUG"                         = "1"
              + "AZUL_DEPLOYMENT_INCARNATION"        = "0"
              + "AZUL_DEPLOYMENT_STAGE"              = "jesse0"
              + "AZUL_DISABLE_MULTIPART_MANIFESTS"   = "0"
              + "AZUL_DOMAIN_NAME"                   = "dev.singlecell.gi.ucsc.edu"
              + "AZUL_DRS_DOMAIN_NAME"               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
              + "AZUL_DSS_DIRECT_ACCESS"             = "0"
              + "AZUL_DSS_WORKERS"                   = "8"
              + "AZUL_ENABLE_MONITORING"             = "0"
              + "AZUL_ES_DOMAIN"                     = "azul-index-sandbox"
              + "AZUL_ES_ENDPOINT"                   = "search-azul-index-sandbox-mcwjphhhdivigzrsrdmxm2uude.us-east-1.es.amazonaws.com:443"
              + "AZUL_ES_INSTANCE_COUNT"             = "2"
              + "AZUL_ES_INSTANCE_TYPE"              = "r4.2xlarge.elasticsearch"
              + "AZUL_ES_TIMEOUT"                    = "60"
              + "AZUL_ES_VOLUME_SIZE"                = "70"
              + "AZUL_GOOGLE_SERVICE_ACCOUNT"        = "azul-ucsc-0-jesse0"
              + "AZUL_INDEXER_CONCURRENCY"           = "8"
              + "AZUL_INDEX_PREFIX"                  = "azul"
              + "AZUL_OWNER"                         = "jrbrenna@ucsc.edu"
              + "AZUL_RESOURCE_PREFIX"               = "azul"
              + "AZUL_S3_BUCKET"                     = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
              + "AZUL_SAM_SERVICE_URL"               = "https://sam.dsde-dev.broadinstitute.org"
              + "AZUL_SHARE_ES_DOMAIN"               = "1"
              + "AZUL_SUBDOMAIN_TEMPLATE"            = "*.jesse0"
              + "AZUL_SUBSCRIBE_TO_DSS"              = "0"
              + "AZUL_TDR_DCP2EBI_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT2EBI_SOURCES"            = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT3LUNGMAP_SOURCES"        = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_LUNGMAP_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_SERVICE_URL"               = "https://jade.datarepo-dev.broadinstitute.org"
              + "AZUL_TDR_SOURCES"                   = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201203___20210219"
              + "AZUL_TDR_WORKERS"                   = "1"
              + "AZUL_URL_REDIRECT_BASE_DOMAIN_NAME" = "dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_URL_REDIRECT_FULL_DOMAIN_NAME" = "jesse0.dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_VERSIONED_BUCKET"              = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
              + "XDG_CONFIG_HOME"                    = "/tmp"
              + "azul_git_commit"                    = "9aab4f6a4460309044cd457dc8fc9a5ecf6140f2"
              + "azul_git_dirty"                     = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.chalice_indexer.aws_lambda_permission.indexercachehealth will be created
  + resource "aws_lambda_permission" "indexercachehealth" {
      + action        = "lambda:InvokeFunction"
      + function_name = "azul-indexer-jesse0-indexercachehealth"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

  # module.chalice_indexer.aws_lambda_permission.rest_api_invoke will be created
  + resource "aws_lambda_permission" "rest_api_invoke" {
      + action        = "lambda:InvokeFunction"
      + function_name = "azul-indexer-jesse0"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

  # module.chalice_service.data.template_file.chalice_api_swagger will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "chalice_api_swagger"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # module.chalice_service.aws_api_gateway_deployment.rest_api will be created
  + resource "aws_api_gateway_deployment" "rest_api" {
      + created_date      = (known after apply)
      + execution_arn     = (known after apply)
      + id                = (known after apply)
      + invoke_url        = (known after apply)
      + rest_api_id       = (known after apply)
      + stage_description = (known after apply)
      + stage_name        = "jesse0"
    }

  # module.chalice_service.aws_api_gateway_rest_api.rest_api will be created
  + resource "aws_api_gateway_rest_api" "rest_api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + binary_media_types       = [
          + "application/octet-stream",
          + "application/x-tar",
          + "application/zip",
          + "audio/basic",
          + "audio/ogg",
          + "audio/mp4",
          + "audio/mpeg",
          + "audio/wav",
          + "audio/webm",
          + "image/png",
          + "image/jpg",
          + "image/jpeg",
          + "image/gif",
          + "video/ogg",
          + "video/mpeg",
          + "video/webm",
        ]
      + body                     = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "azul-service-jesse0"
      + root_resource_id         = (known after apply)
      + tags                     = {
          + "Name"       = "azul-rest_api-jesse0"
          + "component"  = "azul-rest_api"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }

      + endpoint_configuration {
          + types = [
              + "EDGE",
            ]
        }
    }

  # module.chalice_service.aws_cloudwatch_event_rule.servicecachehealth will be created
  + resource "aws_cloudwatch_event_rule" "servicecachehealth" {
      + arn                 = (known after apply)
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "azul-servicecachehealth-jesse0"
      + schedule_expression = "rate(1 minute)"
      + tags                = {
          + "Name"       = "azul-servicecachehealth-jesse0"
          + "component"  = "azul-servicecachehealth"
          + "deployment" = "jesse0"
          + "owner"      = "jrbrenna@ucsc.edu"
          + "project"    = "dcp"
          + "service"    = "azul"
        }
    }

  # module.chalice_service.aws_cloudwatch_event_target.servicecachehealth will be created
  + resource "aws_cloudwatch_event_target" "servicecachehealth" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "azul-servicecachehealth-jesse0"
      + target_id = "azul-servicecachehealth-jesse0"
    }

  # module.chalice_service.aws_lambda_function.api_handler will be created
  + resource "aws_lambda_function" "api_handler" {
      + arn                            = (known after apply)
      + filename                       = "service/deployment.zip"
      + function_name                  = "azul-service-jesse0"
      + handler                        = "app.app"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "Y7tSJU0LTyYCeyrt9nBR7obr3su2xlZRhQ0KF+mrfyA="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"        = "azul-api_handler-jesse0"
          + "aws-chalice" = "version=1.18.0:stage=jesse0:app=azul-service"
          + "component"   = "azul-api_handler"
          + "deployment"  = "jesse0"
          + "owner"       = "jrbrenna@ucsc.edu"
          + "project"     = "dcp"
          + "service"     = "azul"
        }
      + timeout                        = 31
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AZUL_AWS_ACCOUNT_ID"                = "122796619775"
              + "AZUL_CATALOGS"                      = "hca:dcp2:repository/tdr:metadata/hca,hca:dcp2ebi:repository/tdr:metadata/hca,lungmap:lungmap:repository/tdr:metadata/hca,hca:it2:repository/tdr:metadata/hca,hca:it2ebi:repository/tdr:metadata/hca,lungmap:it3lungmap:repository/tdr:metadata/hca"
              + "AZUL_DEBUG"                         = "1"
              + "AZUL_DEPLOYMENT_INCARNATION"        = "0"
              + "AZUL_DEPLOYMENT_STAGE"              = "jesse0"
              + "AZUL_DISABLE_MULTIPART_MANIFESTS"   = "0"
              + "AZUL_DOMAIN_NAME"                   = "dev.singlecell.gi.ucsc.edu"
              + "AZUL_DRS_DOMAIN_NAME"               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
              + "AZUL_DSS_DIRECT_ACCESS"             = "0"
              + "AZUL_DSS_WORKERS"                   = "8"
              + "AZUL_ENABLE_MONITORING"             = "0"
              + "AZUL_ES_DOMAIN"                     = "azul-index-sandbox"
              + "AZUL_ES_ENDPOINT"                   = "search-azul-index-sandbox-mcwjphhhdivigzrsrdmxm2uude.us-east-1.es.amazonaws.com:443"
              + "AZUL_ES_INSTANCE_COUNT"             = "2"
              + "AZUL_ES_INSTANCE_TYPE"              = "r4.2xlarge.elasticsearch"
              + "AZUL_ES_TIMEOUT"                    = "60"
              + "AZUL_ES_VOLUME_SIZE"                = "70"
              + "AZUL_GOOGLE_SERVICE_ACCOUNT"        = "azul-ucsc-0-jesse0"
              + "AZUL_INDEXER_CONCURRENCY"           = "8"
              + "AZUL_INDEX_PREFIX"                  = "azul"
              + "AZUL_OWNER"                         = "jrbrenna@ucsc.edu"
              + "AZUL_RESOURCE_PREFIX"               = "azul"
              + "AZUL_S3_BUCKET"                     = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
              + "AZUL_SAM_SERVICE_URL"               = "https://sam.dsde-dev.broadinstitute.org"
              + "AZUL_SHARE_ES_DOMAIN"               = "1"
              + "AZUL_SUBDOMAIN_TEMPLATE"            = "*.jesse0"
              + "AZUL_SUBSCRIBE_TO_DSS"              = "0"
              + "AZUL_TDR_DCP2EBI_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT2EBI_SOURCES"            = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT3LUNGMAP_SOURCES"        = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_LUNGMAP_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_SERVICE_URL"               = "https://jade.datarepo-dev.broadinstitute.org"
              + "AZUL_TDR_SOURCES"                   = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201203___20210219"
              + "AZUL_TDR_WORKERS"                   = "1"
              + "AZUL_URL_REDIRECT_BASE_DOMAIN_NAME" = "dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_URL_REDIRECT_FULL_DOMAIN_NAME" = "jesse0.dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_VERSIONED_BUCKET"              = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
              + "XDG_CONFIG_HOME"                    = "/tmp"
              + "azul_git_commit"                    = "9aab4f6a4460309044cd457dc8fc9a5ecf6140f2"
              + "azul_git_dirty"                     = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.chalice_service.aws_lambda_function.manifest will be created
  + resource "aws_lambda_function" "manifest" {
      + arn                            = (known after apply)
      + filename                       = "service/deployment.zip"
      + function_name                  = "azul-service-jesse0-manifest"
      + handler                        = "app.generate_manifest"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "Y7tSJU0LTyYCeyrt9nBR7obr3su2xlZRhQ0KF+mrfyA="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"        = "azul-manifest-jesse0"
          + "aws-chalice" = "version=1.18.0:stage=jesse0:app=azul-service"
          + "component"   = "azul-manifest"
          + "deployment"  = "jesse0"
          + "owner"       = "jrbrenna@ucsc.edu"
          + "project"     = "dcp"
          + "service"     = "azul"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AZUL_AWS_ACCOUNT_ID"                = "122796619775"
              + "AZUL_CATALOGS"                      = "hca:dcp2:repository/tdr:metadata/hca,hca:dcp2ebi:repository/tdr:metadata/hca,lungmap:lungmap:repository/tdr:metadata/hca,hca:it2:repository/tdr:metadata/hca,hca:it2ebi:repository/tdr:metadata/hca,lungmap:it3lungmap:repository/tdr:metadata/hca"
              + "AZUL_DEBUG"                         = "1"
              + "AZUL_DEPLOYMENT_INCARNATION"        = "0"
              + "AZUL_DEPLOYMENT_STAGE"              = "jesse0"
              + "AZUL_DISABLE_MULTIPART_MANIFESTS"   = "0"
              + "AZUL_DOMAIN_NAME"                   = "dev.singlecell.gi.ucsc.edu"
              + "AZUL_DRS_DOMAIN_NAME"               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
              + "AZUL_DSS_DIRECT_ACCESS"             = "0"
              + "AZUL_DSS_WORKERS"                   = "8"
              + "AZUL_ENABLE_MONITORING"             = "0"
              + "AZUL_ES_DOMAIN"                     = "azul-index-sandbox"
              + "AZUL_ES_ENDPOINT"                   = "search-azul-index-sandbox-mcwjphhhdivigzrsrdmxm2uude.us-east-1.es.amazonaws.com:443"
              + "AZUL_ES_INSTANCE_COUNT"             = "2"
              + "AZUL_ES_INSTANCE_TYPE"              = "r4.2xlarge.elasticsearch"
              + "AZUL_ES_TIMEOUT"                    = "60"
              + "AZUL_ES_VOLUME_SIZE"                = "70"
              + "AZUL_GOOGLE_SERVICE_ACCOUNT"        = "azul-ucsc-0-jesse0"
              + "AZUL_INDEXER_CONCURRENCY"           = "8"
              + "AZUL_INDEX_PREFIX"                  = "azul"
              + "AZUL_OWNER"                         = "jrbrenna@ucsc.edu"
              + "AZUL_RESOURCE_PREFIX"               = "azul"
              + "AZUL_S3_BUCKET"                     = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
              + "AZUL_SAM_SERVICE_URL"               = "https://sam.dsde-dev.broadinstitute.org"
              + "AZUL_SHARE_ES_DOMAIN"               = "1"
              + "AZUL_SUBDOMAIN_TEMPLATE"            = "*.jesse0"
              + "AZUL_SUBSCRIBE_TO_DSS"              = "0"
              + "AZUL_TDR_DCP2EBI_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT2EBI_SOURCES"            = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT3LUNGMAP_SOURCES"        = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_LUNGMAP_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_SERVICE_URL"               = "https://jade.datarepo-dev.broadinstitute.org"
              + "AZUL_TDR_SOURCES"                   = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201203___20210219"
              + "AZUL_TDR_WORKERS"                   = "1"
              + "AZUL_URL_REDIRECT_BASE_DOMAIN_NAME" = "dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_URL_REDIRECT_FULL_DOMAIN_NAME" = "jesse0.dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_VERSIONED_BUCKET"              = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
              + "XDG_CONFIG_HOME"                    = "/tmp"
              + "azul_git_commit"                    = "9aab4f6a4460309044cd457dc8fc9a5ecf6140f2"
              + "azul_git_dirty"                     = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.chalice_service.aws_lambda_function.servicecachehealth will be created
  + resource "aws_lambda_function" "servicecachehealth" {
      + arn                            = (known after apply)
      + filename                       = "service/deployment.zip"
      + function_name                  = "azul-service-jesse0-servicecachehealth"
      + handler                        = "app.update_health_cache"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "Y7tSJU0LTyYCeyrt9nBR7obr3su2xlZRhQ0KF+mrfyA="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"        = "azul-servicecachehealth-jesse0"
          + "aws-chalice" = "version=1.18.0:stage=jesse0:app=azul-service"
          + "component"   = "azul-servicecachehealth"
          + "deployment"  = "jesse0"
          + "owner"       = "jrbrenna@ucsc.edu"
          + "project"     = "dcp"
          + "service"     = "azul"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AZUL_AWS_ACCOUNT_ID"                = "122796619775"
              + "AZUL_CATALOGS"                      = "hca:dcp2:repository/tdr:metadata/hca,hca:dcp2ebi:repository/tdr:metadata/hca,lungmap:lungmap:repository/tdr:metadata/hca,hca:it2:repository/tdr:metadata/hca,hca:it2ebi:repository/tdr:metadata/hca,lungmap:it3lungmap:repository/tdr:metadata/hca"
              + "AZUL_DEBUG"                         = "1"
              + "AZUL_DEPLOYMENT_INCARNATION"        = "0"
              + "AZUL_DEPLOYMENT_STAGE"              = "jesse0"
              + "AZUL_DISABLE_MULTIPART_MANIFESTS"   = "0"
              + "AZUL_DOMAIN_NAME"                   = "dev.singlecell.gi.ucsc.edu"
              + "AZUL_DRS_DOMAIN_NAME"               = "drs.jesse0.dev.singlecell.gi.ucsc.edu"
              + "AZUL_DSS_DIRECT_ACCESS"             = "0"
              + "AZUL_DSS_WORKERS"                   = "8"
              + "AZUL_ENABLE_MONITORING"             = "0"
              + "AZUL_ES_DOMAIN"                     = "azul-index-sandbox"
              + "AZUL_ES_ENDPOINT"                   = "search-azul-index-sandbox-mcwjphhhdivigzrsrdmxm2uude.us-east-1.es.amazonaws.com:443"
              + "AZUL_ES_INSTANCE_COUNT"             = "2"
              + "AZUL_ES_INSTANCE_TYPE"              = "r4.2xlarge.elasticsearch"
              + "AZUL_ES_TIMEOUT"                    = "60"
              + "AZUL_ES_VOLUME_SIZE"                = "70"
              + "AZUL_GOOGLE_SERVICE_ACCOUNT"        = "azul-ucsc-0-jesse0"
              + "AZUL_INDEXER_CONCURRENCY"           = "8"
              + "AZUL_INDEX_PREFIX"                  = "azul"
              + "AZUL_OWNER"                         = "jrbrenna@ucsc.edu"
              + "AZUL_RESOURCE_PREFIX"               = "azul"
              + "AZUL_S3_BUCKET"                     = "edu-ucsc-gi-singlecell-azul-storage-jesse0"
              + "AZUL_SAM_SERVICE_URL"               = "https://sam.dsde-dev.broadinstitute.org"
              + "AZUL_SHARE_ES_DOMAIN"               = "1"
              + "AZUL_SUBDOMAIN_TEMPLATE"            = "*.jesse0"
              + "AZUL_SUBSCRIBE_TO_DSS"              = "0"
              + "AZUL_TDR_DCP2EBI_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT2EBI_SOURCES"            = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201023_ebiv4___20210302"
              + "AZUL_TDR_IT3LUNGMAP_SOURCES"        = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_LUNGMAP_SOURCES"           = "tdr:broad-jade-dev-data:snapshot/lungmap_dev_20210412__20210414"
              + "AZUL_TDR_SERVICE_URL"               = "https://jade.datarepo-dev.broadinstitute.org"
              + "AZUL_TDR_SOURCES"                   = "tdr:broad-jade-dev-data:snapshot/hca_dev_20201203___20210219"
              + "AZUL_TDR_WORKERS"                   = "1"
              + "AZUL_URL_REDIRECT_BASE_DOMAIN_NAME" = "dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_URL_REDIRECT_FULL_DOMAIN_NAME" = "jesse0.dev.url.singlecell.gi.ucsc.edu"
              + "AZUL_VERSIONED_BUCKET"              = "edu-ucsc-gi-singlecell-azul-config-dev.us-east-1"
              + "XDG_CONFIG_HOME"                    = "/tmp"
              + "azul_git_commit"                    = "9aab4f6a4460309044cd457dc8fc9a5ecf6140f2"
              + "azul_git_dirty"                     = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.chalice_service.aws_lambda_permission.rest_api_invoke will be created
  + resource "aws_lambda_permission" "rest_api_invoke" {
      + action        = "lambda:InvokeFunction"
      + function_name = "azul-service-jesse0"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

  # module.chalice_service.aws_lambda_permission.servicecachehealth will be created
  + resource "aws_lambda_permission" "servicecachehealth" {
      + action        = "lambda:InvokeFunction"
      + function_name = "azul-service-jesse0-servicecachehealth"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

Plan: 67 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

null_resource.hmac_secret: Creating...
null_resource.hmac_secret: Provisioning with 'local-exec'...
null_resource.hmac_secret (local-exec): Executing: ["/bin/sh" "-c" "python /home/jesse/gi/azul/scripts/provision_credentials.py hmac-key --build"]
google_service_account.azul: Creating...
google_project_iam_custom_role.azul: Creating...
null_resource.hmac_secret (local-exec): 2021-04-22 14:39:39,918 INFO    MainThread: Found credentials in environment variables.
null_resource.hmac_secret (local-exec): 2021-04-22 14:39:40,429 INFO    MainThread: AWS secret dcp/azul/jesse0/indexer/hmac created.
null_resource.hmac_secret (local-exec): 2021-04-22 14:39:40,747 INFO    MainThread: Successfully wrote value to AWS secret 'dcp/azul/jesse0/indexer/hmac'.
null_resource.hmac_secret: Creation complete after 1s [id=1664851208773596918]
google_project_iam_custom_role.azul: Creation complete after 1s [id=projects/platform-hca-dev/roles/azul_jesse0]
google_service_account.azul: Provisioning with 'local-exec'...
google_service_account.azul (local-exec): Executing: ["/bin/sh" "-c" "python /home/jesse/gi/azul/scripts/provision_credentials.py google-key --build 'azul-ucsc-0-jesse0@platform-hca-dev.iam.gserviceaccount.com'"]
google_service_account.azul (local-exec): 2021-04-22 14:39:41,985 INFO    MainThread: Found credentials in environment variables.
google_service_account.azul (local-exec): 2021-04-22 14:39:42,388 INFO    MainThread: AWS secret dcp/azul/jesse0/google_service_account created.
google_service_account.azul (local-exec): 2021-04-22 14:39:42,513 INFO    MainThread: URL being requested: GET https://www.googleapis.com/discovery/v1/apis/iam/v1/rest
aws_iam_role.service: Creating...
aws_iam_role.states: Creating...
aws_iam_role.indexer: Creating...
aws_sqs_queue.notifications_fail: Creating...
module.chalice_service.aws_cloudwatch_event_rule.servicecachehealth: Creating...
module.chalice_indexer.aws_cloudwatch_event_rule.indexercachehealth: Creating...
aws_dynamodb_table.object_versions: Creating...
aws_sqs_queue.tallies_fail: Creating...
aws_s3_bucket.storage: Creating...
google_service_account.azul (local-exec): 2021-04-22 14:39:43,080 INFO    MainThread: URL being requested: POST https://iam.googleapis.com/v1/projects/-/serviceAccounts/azul-ucsc-0-jesse0@platform-hca-dev.iam.gserviceaccount.com/keys?alt=json
aws_iam_role.states: Creation complete after 0s [id=azul-statemachine-jesse0]
aws_iam_role.indexer: Creation complete after 0s [id=azul-indexer-jesse0]
aws_lambda_layer_version.dependencies: Creating...
aws_iam_role.service: Creation complete after 0s [id=azul-service-jesse0]
aws_iam_role_policy.states: Creating...
aws_s3_bucket.urls: Creating...
module.chalice_indexer.aws_cloudwatch_event_rule.indexercachehealth: Creation complete after 1s [id=azul-indexercachehealth-jesse0]
aws_sfn_state_machine.manifest: Creating...
module.chalice_service.aws_cloudwatch_event_rule.servicecachehealth: Creation complete after 1s [id=azul-servicecachehealth-jesse0]
aws_iam_role_policy.indexer: Creating...
aws_sqs_queue.tallies_fail: Creation complete after 1s [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-tallies_fail-jesse0.fifo]
aws_sqs_queue.notifications_fail: Creation complete after 1s [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-notifications_fail-jesse0]
aws_iam_role_policy.service: Creating...
aws_acm_certificate.service_0: Creating...
google_service_account.azul (local-exec): 2021-04-22 14:39:44,043 INFO    MainThread: Successfully created service account key for user 'azul-ucsc-0-jesse0@platform-hca-dev.iam.gserviceaccount.com'
google_service_account.azul (local-exec): 2021-04-22 14:39:44,228 INFO    MainThread: Successfully wrote value to AWS secret 'dcp/azul/jesse0/google_service_account'.
aws_iam_role_policy.states: Creation complete after 1s [id=azul-statemachine-jesse0:azul-statemachine-jesse0]
aws_acm_certificate.service_1: Creating...
google_service_account.azul: Creation complete after 4s [id=projects/platform-hca-dev/serviceAccounts/azul-ucsc-0-jesse0@platform-hca-dev.iam.gserviceaccount.com]
aws_acm_certificate.indexer_0: Creating...
aws_iam_role_policy.indexer: Creation complete after 1s [id=azul-indexer-jesse0:indexer]
module.chalice_indexer.aws_lambda_permission.indexercachehealth: Creating...
aws_iam_role_policy.service: Creation complete after 1s [id=azul-service-jesse0:service]
module.chalice_service.aws_lambda_permission.servicecachehealth: Creating...
aws_sfn_state_machine.manifest: Creation complete after 1s [id=arn:aws:states:us-east-1:122796619775:stateMachine:azul-manifest-jesse0]
aws_sqs_queue.tallies_retry: Creating...
aws_sqs_queue.tallies_retry: Creation complete after 1s [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-tallies_retry-jesse0.fifo]
aws_sqs_queue.notifications_retry: Creating...
aws_sqs_queue.notifications_retry: Creation complete after 2s [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-notifications_retry-jesse0]
google_project_iam_member.azul: Creating...
aws_s3_bucket.storage: Creation complete after 7s [id=edu-ucsc-gi-singlecell-azul-storage-jesse0]
aws_sqs_queue.tallies: Creating...
aws_s3_bucket.urls: Creation complete after 8s [id=jesse0.dev.url.singlecell.gi.ucsc.edu]
aws_sqs_queue.notifications: Creating...
aws_acm_certificate.service_1: Creation complete after 7s [id=arn:aws:acm:us-east-1:122796619775:certificate/7d7324de-cc94-4454-ac3e-d3e567d0b991]
aws_route53_record.url_redirect_record: Creating...
aws_sqs_queue.tallies: Creation complete after 2s [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-tallies-jesse0.fifo]
aws_route53_record.service_domain_validation_1: Creating...
aws_acm_certificate.service_0: Creation complete after 8s [id=arn:aws:acm:us-east-1:122796619775:certificate/20562a54-1e90-4f23-9153-304d4937bfe7]
aws_route53_record.service_domain_validation_0: Creating...
aws_sqs_queue.notifications: Creation complete after 1s [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-notifications-jesse0]
aws_dynamodb_table.object_versions: Still creating... [10s elapsed]
aws_dynamodb_table.object_versions: Creation complete after 10s [id=azul-object_versions-jesse0]
aws_lambda_layer_version.dependencies: Still creating... [10s elapsed]
aws_acm_certificate.indexer_0: Creation complete after 9s [id=arn:aws:acm:us-east-1:122796619775:certificate/a82daa00-94d8-4a1e-b5d4-c72527b40fe2]
aws_route53_record.indexer_domain_validation_0: Creating...
module.chalice_indexer.aws_lambda_permission.indexercachehealth: Still creating... [10s elapsed]
module.chalice_service.aws_lambda_permission.servicecachehealth: Still creating... [10s elapsed]
aws_lambda_layer_version.dependencies: Creation complete after 13s [id=arn:aws:lambda:us-east-1:122796619775:layer:azul-dependencies-jesse0:8]
module.chalice_indexer.aws_lambda_function.api_handler: Creating...
module.chalice_service.aws_lambda_function.api_handler: Creating...
module.chalice_indexer.aws_lambda_function.aggregate: Creating...
google_project_iam_member.azul: Still creating... [10s elapsed]
aws_route53_record.url_redirect_record: Still creating... [10s elapsed]
aws_route53_record.service_domain_validation_1: Still creating... [10s elapsed]
aws_route53_record.service_domain_validation_0: Still creating... [10s elapsed]
google_project_iam_member.azul: Creation complete after 15s [id=platform-hca-dev/projects/platform-hca-dev/roles/azul_jesse0/serviceaccount:azul-ucsc-0-jesse0@platform-hca-dev.iam.gserviceaccount.com]
module.chalice_service.aws_lambda_function.manifest: Creating...
aws_route53_record.indexer_domain_validation_0: Still creating... [10s elapsed]
module.chalice_indexer.aws_lambda_permission.indexercachehealth: Still creating... [20s elapsed]
module.chalice_service.aws_lambda_permission.servicecachehealth: Still creating... [20s elapsed]
module.chalice_indexer.aws_lambda_function.api_handler: Still creating... [10s elapsed]
module.chalice_service.aws_lambda_function.api_handler: Still creating... [10s elapsed]
module.chalice_indexer.aws_lambda_function.aggregate: Still creating... [10s elapsed]
module.chalice_indexer.aws_lambda_function.api_handler: Creation complete after 13s [id=azul-indexer-jesse0]
module.chalice_indexer.aws_lambda_function.contribute_retry: Creating...
aws_route53_record.url_redirect_record: Still creating... [20s elapsed]
aws_route53_record.service_domain_validation_1: Still creating... [20s elapsed]
aws_route53_record.service_domain_validation_0: Still creating... [20s elapsed]
module.chalice_service.aws_lambda_function.manifest: Still creating... [10s elapsed]
aws_route53_record.indexer_domain_validation_0: Still creating... [20s elapsed]
module.chalice_indexer.aws_lambda_permission.indexercachehealth: Still creating... [30s elapsed]
module.chalice_service.aws_lambda_permission.servicecachehealth: Still creating... [30s elapsed]
module.chalice_service.aws_lambda_function.api_handler: Still creating... [20s elapsed]
module.chalice_indexer.aws_lambda_function.aggregate: Still creating... [20s elapsed]
module.chalice_indexer.aws_lambda_function.contribute_retry: Still creating... [10s elapsed]
module.chalice_service.aws_lambda_function.api_handler: Creation complete after 25s [id=azul-service-jesse0]
module.chalice_indexer.aws_lambda_function.indexercachehealth: Creating...
aws_route53_record.url_redirect_record: Still creating... [30s elapsed]
aws_route53_record.service_domain_validation_1: Still creating... [30s elapsed]
aws_route53_record.service_domain_validation_0: Still creating... [30s elapsed]
module.chalice_service.aws_lambda_function.manifest: Still creating... [20s elapsed]
aws_route53_record.indexer_domain_validation_0: Still creating... [30s elapsed]
module.chalice_indexer.aws_lambda_permission.indexercachehealth: Still creating... [40s elapsed]
module.chalice_service.aws_lambda_permission.servicecachehealth: Still creating... [40s elapsed]
module.chalice_indexer.aws_lambda_function.aggregate: Still creating... [30s elapsed]
module.chalice_indexer.aws_lambda_function.contribute_retry: Still creating... [20s elapsed]
module.chalice_indexer.aws_lambda_function.indexercachehealth: Still creating... [10s elapsed]
aws_route53_record.url_redirect_record: Still creating... [40s elapsed]
aws_route53_record.service_domain_validation_1: Still creating... [40s elapsed]
aws_route53_record.service_domain_validation_0: Still creating... [40s elapsed]
module.chalice_service.aws_lambda_function.manifest: Still creating... [30s elapsed]
aws_route53_record.indexer_domain_validation_0: Still creating... [40s elapsed]
module.chalice_indexer.aws_lambda_function.aggregate: Creation complete after 38s [id=azul-indexer-jesse0-aggregate]
module.chalice_indexer.aws_lambda_function.contribute: Creating...
module.chalice_indexer.aws_lambda_permission.indexercachehealth: Still creating... [50s elapsed]
module.chalice_service.aws_lambda_permission.servicecachehealth: Still creating... [50s elapsed]
module.chalice_indexer.aws_lambda_function.contribute_retry: Still creating... [30s elapsed]
module.chalice_indexer.aws_lambda_function.indexercachehealth: Still creating... [20s elapsed]
aws_route53_record.url_redirect_record: Still creating... [50s elapsed]
aws_route53_record.service_domain_validation_1: Still creating... [50s elapsed]
aws_route53_record.service_domain_validation_0: Still creating... [50s elapsed]
module.chalice_service.aws_lambda_function.manifest: Still creating... [40s elapsed]
aws_route53_record.indexer_domain_validation_0: Still creating... [50s elapsed]
module.chalice_indexer.aws_lambda_function.contribute: Still creating... [10s elapsed]
module.chalice_service.aws_lambda_function.manifest: Creation complete after 41s [id=azul-service-jesse0-manifest]
module.chalice_service.aws_lambda_function.servicecachehealth: Creating...
module.chalice_indexer.aws_lambda_permission.indexercachehealth: Still creating... [1m0s elapsed]
module.chalice_indexer.aws_lambda_function.aggregate_retry: Creating...
module.chalice_indexer.data.template_file.chalice_api_swagger: Refreshing state...
module.chalice_service.data.template_file.chalice_api_swagger: Refreshing state...
module.chalice_indexer.aws_lambda_event_source_mapping.aggregate-sqs-event-source: Creating...
module.chalice_indexer.aws_lambda_event_source_mapping.aggregate-sqs-event-source: Creation complete after 1s [id=3b859c70-306c-4680-810f-45f63b89c518]
module.chalice_indexer.aws_api_gateway_rest_api.rest_api: Creating...
module.chalice_indexer.aws_api_gateway_rest_api.rest_api: Creation complete after 3s [id=p7c9dhz2w9]
module.chalice_service.aws_api_gateway_rest_api.rest_api: Creating...
module.chalice_indexer.aws_lambda_function.contribute_retry: Still creating... [40s elapsed]
module.chalice_indexer.aws_lambda_function.indexercachehealth: Still creating... [30s elapsed]
aws_route53_record.url_redirect_record: Still creating... [1m0s elapsed]
aws_route53_record.service_domain_validation_1: Still creating... [1m0s elapsed]
aws_route53_record.url_redirect_record: Creation complete after 1m1s [id=Z3QI5CRH8COLZN_jesse0.dev.url.singlecell.gi.ucsc.edu_CNAME]
module.chalice_indexer.aws_api_gateway_deployment.rest_api: Creating...
aws_route53_record.service_domain_validation_1: Creation complete after 1m0s [id=ZRJRXAKW4OYOA__78a549dceeea1c4e9b2c1e9973e33704.drs.jesse0.dev.singlecell.gi.ucsc.edu._CNAME]
module.chalice_indexer.aws_lambda_permission.rest_api_invoke: Creating...
aws_route53_record.service_domain_validation_0: Still creating... [1m0s elapsed]
aws_route53_record.service_domain_validation_0: Creation complete after 1m0s [id=ZRJRXAKW4OYOA__587b762ea6562290cfd7c27aacb2a072.service.jesse0.dev.singlecell.gi.ucsc.edu._CNAME]
aws_api_gateway_deployment.indexer: Creating...
module.chalice_indexer.aws_lambda_permission.rest_api_invoke: Creation complete after 0s [id=terraform-20210422214051687600000003]
aws_acm_certificate_validation.service_1: Creating...
module.chalice_indexer.aws_api_gateway_deployment.rest_api: Creation complete after 1s [id=28o98q]
aws_acm_certificate_validation.service_0: Creating...
aws_route53_record.indexer_domain_validation_0: Creation complete after 1m0s [id=ZRJRXAKW4OYOA__d9955160e9a3813edd34fdd377c0b3e3.indexer.jesse0.dev.singlecell.gi.ucsc.edu._CNAME]
aws_acm_certificate_validation.indexer_0: Creating...
aws_api_gateway_deployment.indexer: Creation complete after 1s [id=ehs4uj]
module.chalice_indexer.aws_lambda_function.contribute: Still creating... [20s elapsed]
aws_acm_certificate_validation.service_1: Creation complete after 2s [id=2021-04-22 21:40:14 +0000 UTC]
aws_api_gateway_domain_name.service_1: Creating...
module.chalice_service.aws_lambda_function.servicecachehealth: Still creating... [10s elapsed]
aws_acm_certificate_validation.service_0: Creation complete after 2s [id=2021-04-22 21:40:03 +0000 UTC]
aws_api_gateway_domain_name.service_0: Creating...
module.chalice_indexer.aws_lambda_function.aggregate_retry: Still creating... [10s elapsed]
aws_acm_certificate_validation.indexer_0: Creation complete after 2s [id=2021-04-22 21:40:07 +0000 UTC]
aws_api_gateway_domain_name.indexer_0: Creating...
module.chalice_indexer.aws_lambda_function.contribute_retry: Creation complete after 47s [id=azul-indexer-jesse0-contribute_retry]
module.chalice_indexer.aws_lambda_event_source_mapping.contribute_retry-sqs-event-source: Creating...
module.chalice_indexer.aws_lambda_event_source_mapping.contribute_retry-sqs-event-source: Creation complete after 1s [id=e6e7573b-159c-4a7e-95d7-d96926b5eb23]
aws_api_gateway_domain_name.service_1: Creation complete after 3s [id=drs.jesse0.dev.singlecell.gi.ucsc.edu]
aws_route53_record.service_1: Creating...
module.chalice_service.aws_api_gateway_rest_api.rest_api: Still creating... [10s elapsed]
module.chalice_indexer.aws_lambda_function.indexercachehealth: Still creating... [40s elapsed]
module.chalice_indexer.aws_lambda_function.contribute: Still creating... [30s elapsed]
module.chalice_service.aws_lambda_function.servicecachehealth: Still creating... [20s elapsed]
aws_api_gateway_domain_name.service_0: Still creating... [10s elapsed]
module.chalice_indexer.aws_lambda_function.aggregate_retry: Still creating... [20s elapsed]
aws_api_gateway_domain_name.indexer_0: Still creating... [10s elapsed]
module.chalice_indexer.aws_lambda_function.indexercachehealth: Creation complete after 45s [id=azul-indexer-jesse0-indexercachehealth]
module.chalice_indexer.aws_cloudwatch_event_target.indexercachehealth: Creating...
module.chalice_indexer.aws_cloudwatch_event_target.indexercachehealth: Creation complete after 1s [id=azul-indexercachehealth-jesse0-azul-indexercachehealth-jesse0]
aws_route53_record.service_1: Still creating... [10s elapsed]
module.chalice_service.aws_api_gateway_rest_api.rest_api: Still creating... [20s elapsed]
module.chalice_indexer.aws_lambda_function.contribute: Still creating... [40s elapsed]
module.chalice_service.aws_lambda_function.servicecachehealth: Still creating... [30s elapsed]
aws_api_gateway_domain_name.service_0: Still creating... [20s elapsed]
module.chalice_indexer.aws_lambda_function.aggregate_retry: Still creating... [30s elapsed]
aws_api_gateway_domain_name.indexer_0: Still creating... [20s elapsed]
aws_route53_record.service_1: Still creating... [20s elapsed]
module.chalice_indexer.aws_lambda_function.contribute: Creation complete after 44s [id=azul-indexer-jesse0-contribute]
module.chalice_indexer.aws_lambda_event_source_mapping.contribute-sqs-event-source: Creating...
module.chalice_service.aws_api_gateway_rest_api.rest_api: Still creating... [30s elapsed]
module.chalice_indexer.aws_lambda_event_source_mapping.contribute-sqs-event-source: Creation complete after 1s [id=de9fe884-4674-4878-8d4a-838ee27e0a53]
module.chalice_service.aws_lambda_function.servicecachehealth: Still creating... [40s elapsed]
aws_api_gateway_domain_name.service_0: Still creating... [30s elapsed]
module.chalice_indexer.aws_lambda_function.aggregate_retry: Still creating... [40s elapsed]
aws_api_gateway_domain_name.indexer_0: Still creating... [30s elapsed]
aws_route53_record.service_1: Still creating... [30s elapsed]
module.chalice_service.aws_api_gateway_rest_api.rest_api: Still creating... [40s elapsed]
module.chalice_service.aws_lambda_function.servicecachehealth: Creation complete after 47s [id=azul-service-jesse0-servicecachehealth]
module.chalice_service.aws_cloudwatch_event_target.servicecachehealth: Creating...
module.chalice_service.aws_cloudwatch_event_target.servicecachehealth: Creation complete after 1s [id=azul-servicecachehealth-jesse0-azul-servicecachehealth-jesse0]
module.chalice_service.aws_api_gateway_rest_api.rest_api: Creation complete after 45s [id=at5m5u2jsa]
module.chalice_service.aws_lambda_permission.rest_api_invoke: Creating...
aws_api_gateway_deployment.service: Creating...
module.chalice_service.aws_api_gateway_deployment.rest_api: Creating...
aws_api_gateway_domain_name.service_0: Still creating... [40s elapsed]
module.chalice_indexer.aws_lambda_function.aggregate_retry: Still creating... [50s elapsed]
module.chalice_service.aws_lambda_permission.rest_api_invoke: Creation complete after 1s [id=terraform-20210422214134087200000004]
aws_api_gateway_domain_name.indexer_0: Still creating... [40s elapsed]
module.chalice_service.aws_api_gateway_deployment.rest_api: Creation complete after 2s [id=4gqzdf]
aws_route53_record.service_1: Still creating... [40s elapsed]
aws_api_gateway_deployment.service: Creation complete after 4s [id=yb5bqv]
aws_api_gateway_base_path_mapping.service_1: Creating...
aws_api_gateway_base_path_mapping.service_1: Creation complete after 1s [id=drs.jesse0.dev.singlecell.gi.ucsc.edu/]
module.chalice_indexer.aws_lambda_function.aggregate_retry: Creation complete after 58s [id=azul-indexer-jesse0-aggregate_retry]
module.chalice_indexer.aws_lambda_event_source_mapping.aggregate_retry-sqs-event-source: Creating...
module.chalice_indexer.aws_lambda_event_source_mapping.aggregate_retry-sqs-event-source: Creation complete after 1s [id=c0aaf8c1-3ab3-4d96-9116-acd0d7c346c0]
aws_api_gateway_domain_name.service_0: Creation complete after 49s [id=service.jesse0.dev.singlecell.gi.ucsc.edu]
aws_api_gateway_base_path_mapping.service_0: Creating...
aws_route53_record.service_0: Creating...
aws_api_gateway_domain_name.indexer_0: Still creating... [50s elapsed]
aws_api_gateway_base_path_mapping.service_0: Creation complete after 1s [id=service.jesse0.dev.singlecell.gi.ucsc.edu/]
aws_route53_record.service_1: Creation complete after 49s [id=ZRJRXAKW4OYOA_drs.jesse0.dev.singlecell.gi.ucsc.edu_A]
aws_route53_record.service_0: Still creating... [10s elapsed]
aws_api_gateway_domain_name.indexer_0: Still creating... [1m0s elapsed]
aws_route53_record.service_0: Still creating... [20s elapsed]
aws_api_gateway_domain_name.indexer_0: Still creating... [1m10s elapsed]
aws_route53_record.service_0: Still creating... [30s elapsed]
aws_api_gateway_domain_name.indexer_0: Still creating... [1m20s elapsed]
aws_route53_record.service_0: Still creating... [40s elapsed]
aws_api_gateway_domain_name.indexer_0: Still creating... [1m30s elapsed]
aws_route53_record.service_0: Still creating... [50s elapsed]
aws_api_gateway_domain_name.indexer_0: Still creating... [1m40s elapsed]
aws_api_gateway_domain_name.indexer_0: Creation complete after 1m43s [id=indexer.jesse0.dev.singlecell.gi.ucsc.edu]
aws_api_gateway_base_path_mapping.indexer_0: Creating...
aws_route53_record.indexer_0: Creating...
aws_api_gateway_base_path_mapping.indexer_0: Creation complete after 1s [id=indexer.jesse0.dev.singlecell.gi.ucsc.edu/]
aws_route53_record.service_0: Still creating... [1m0s elapsed]
aws_route53_record.service_0: Creation complete after 1m0s [id=ZRJRXAKW4OYOA_service.jesse0.dev.singlecell.gi.ucsc.edu_A]
aws_route53_record.indexer_0: Still creating... [10s elapsed]
aws_route53_record.indexer_0: Still creating... [20s elapsed]
aws_route53_record.indexer_0: Still creating... [30s elapsed]
aws_route53_record.indexer_0: Still creating... [40s elapsed]
aws_route53_record.indexer_0: Still creating... [50s elapsed]
aws_route53_record.indexer_0: Creation complete after 1m0s [id=ZRJRXAKW4OYOA_indexer.jesse0.dev.singlecell.gi.ucsc.edu_A]

Error: Error adding new Lambda Permission for azul-indexer-jesse0-indexercachehealth: ResourceNotFoundException: Function not found: arn:aws:lambda:us-east-1:122796619775:function:azul-indexer-jesse0-indexercachehealth
{
  RespMetadata: {
    StatusCode: 404,
    RequestID: "cd13c7fd-6ec5-4ad2-8f9a-a300e094928a"
  },
  Message_: "Function not found: arn:aws:lambda:us-east-1:122796619775:function:azul-indexer-jesse0-indexercachehealth",
  Type: "User"
}

  on indexer/chalice.tf.json line 457, in resource[3].aws_lambda_permission[0].indexercachehealth:
 457:                     }



Error: Error adding new Lambda Permission for azul-service-jesse0-servicecachehealth: ResourceNotFoundException: Function not found: arn:aws:lambda:us-east-1:122796619775:function:azul-service-jesse0-servicecachehealth
{
  RespMetadata: {
    StatusCode: 404,
    RequestID: "98ed698d-ab23-4ebf-a2bf-f3beb514df56"
  },
  Message_: "Function not found: arn:aws:lambda:us-east-1:122796619775:function:azul-service-jesse0-servicecachehealth",
  Type: "User"
}

  on service/chalice.tf.json line 249, in resource[3].aws_lambda_permission[0].servicecachehealth:
 249:                     }


make[1]: *** [Makefile:32: apply] Error 1
make[1]: Leaving directory '/home/jesse/gi/azul/terraform'
make: *** [Makefile:81: deploy] Error 2
```